Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFNonUniformScalingTransform
The imported geometry contains non-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted.